Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཞབས་འབྲིང་བ་དེ་དག་སོ་སོ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེར་དོང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ནས། ཕྱོགས་གཅིག་ཏུ་འཁོད་དེ། ཅིག་ཅར་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ལྷ་དང་མིའི་སྟོན་པ་དེ་དག་ཚད་མ་མཆིས་པའི་གསུང་གིས་ཅུང་ཟད་མི་བསྙུང་ངམ།
en: Those attendants then approached the Bhagavat Śākyamuni from their different directions, bowed their heads to his feet, arranged themselves in a particular place, and in unison made this request to the Bhagavat: “Those teachers of devas and humans, with their limitless voices, inquired after your health, asking, ‘Are you not a little unwell?

source: བཞེངས་ཤིང་བཞུགས་པ་ཡང་ངམ། སྤྱོད་ལམ་ཐམས་ཅད་དུ་བདེ་བར་སྤྱོད་དམ། ཞེས་སྙུན་གསོལ་ལགས་སོ།
en: Whether you are standing or sitting, in all your activity, are you in good health?’

source: །གཞན་ཡང་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་གདགས་ཤིང་མུ་གེའི་བགེགས་ཡོངས་སུ་བསལ་ནས་བདེ་བ་ལ་འགོད་པར་བཞེད་པའི་ཕྱིར་དེང་གསེར་འོད་དམ་པའི་མདོ་སྡེ་ཤིན་ཏུ་ཟབ་པའི་ཆོས་ཀྱི་དོན་བསྟན་པ་ལེགས་སོ་ལེགས་སོ་ཞེས་གསུངས་སོ།
en: They also said, ‘If the Tathāgata Śākyamuni, in order to benefit beings, to dispel the obstacle of famine, and to bring happiness, were to teach today The Sūtra of the Sublime Golden Light, the meaning of the extremely profound Dharma, that would be excellent, excellent!’ ”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པས་ཞབས་འབྲིང་བའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དེ་བཞིན་གཤེགས་པ་བཞི་པོ་དེ་དག་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བར་བཞེད་པའི་ཕྱིར་ང་ལ་ཡང་དག་པའི་ཆོས་བསྟན་པར་བསྐུལ་བ་ལེགས་སོ་ལེགས་སོ།
en: Then the tathāgata arhat samyaksaṃbuddha Śākyamuni said to those bodhisattva attendants, “It is excellent, excellent that those four tathāgatas have requested the true Dharma in order to bring benefit and happiness to all beings!”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། ང་ནི་རྟག་པར་བྱ་རྒོད་རི་གནས་ནས། །མདོ་སྡེ་རིན་ཆེན་འདི་ནི་འཆད་པར་མཛད། །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པའི་ཕྱིར། །ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བསྟན་པ་ཡིན།
en: At that time, the Bhagavat then spoke these verses: “I am always present on Vulture Peak Mountain, Where I am teaching this precious sūtra, But in order to completely ripen beings, I will manifest passing into nirvāṇa. “

source: །སོ་སོའི་སྐྱེ་བོ་ལོག་ལྟ་བསྐྱེད་ནས་ནི། །ངས་བསྟན་དག་ལ་མངོན་པར་ཡིད་མི་ཆེས། །དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། །ཡོངས་སུ་མྱ་ངན་འདའ་བར་བསྟན་པ་ཡིན།
en: Ordinary beings who have wrong views Will not believe in my teachings; In order to completely ripen them, I will manifest passing into nirvāṇa.”

source: །དེ་ནས་འཁོར་འདུས་པ་ཆེན་པོ་དེ་ཉིད་དུ་བྲམ་ཟེ་ཀཽཎྜི་ནྱས་ཆོས་ཀྱི་སློབ་དཔོན་གྱིས་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དེ་བྲམ་ཟེའི་འཁོར་བརྒྱ་སྟོང་ཚད་མེད་པ་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས།
en: At that time, in that great assembly, there was a brahmin of the Kauṇḍinya family, the Dharma master Vyākaraṇa. Together with a retinue of countless hundreds of thousands of brahmins, he had made offerings to the Bhagavat.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གཤེགས་པ་བཀས་བཤད་པ་ཐོས་པ་དང་མཆི་མ་བླགས་ཏེ་ངུས་ནས་མདུན་དུ་འཕགས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་སེམས་ཅན་རྣམས་ལ་བྱམས་པ་དང་། ཐུགས་རྗེ་ཆེན་པོ་མངའ་བ་སྟེ། ཐུགས་བརྩེ་བས་ཕན་འདོགས་ཤིང་བདེ་བ་འཐོབ་པར་མཛད་དེ།
en: On hearing the Tathāgata speak the words “passing into nirvāṇa,” he shed tears. Weeping, he bowed down to the Bhagavat’s feet and said to the Bhagavat, “If the Tathāgata truly has love for and great compassion for beings, through your kindness benefit them and bring them happiness.

source: ཕ་མ་ལྟ་བུར་གྱུར་པས་གཞན་དེ་དང་མཚུངས་པ་མ་མཆིས་པ་དང་།
en: You are like our mother and father, and therefore there is no one else who is like that.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མགོན་དང་སྐྱབས་མཛད་པས་ཟླ་བ་ཡོངས་སུ་རྒྱས་པ་ལྟར་གསལ་ཞིང་རྣམ་པར་དག་པར་གྱུར་པ་དང་།
en: You are a protector and refuge for the whole world, and therefore you are as bright and pure as the full moon.

source: མཁྱེན་པ་ཆེན་པོས་གསལ་བར་མཛད་པས་གདུགས་དང་པོ་ཤར་བ་ལྟ་བུར་གྱུར་པ་དང་།
en: You bring illumination with your great wisdom, and therefore you are like the rising sun.

source: སེམས་ཅན་རྣམས་ལ་སྙོམས་པར་གཟིགས་པར་མཛད་དེ་སྒྲ་གཅན་ཟིན་ལ་ཅི་ལྟ་བ་བཞིན་དུ་ཐུགས་བརྩེ་བ་ལ་མི་སྙོམས་པ་མི་མངའ་བ་ཞིག་ལགས་ན་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྨོན་ལམ་གཅིག་གནང་བར་མཛད་དུ་གསོལ།
en: You look upon all beings equally, with an affection that is no different from that for Rāhula. I pray that the Bhagavat will give me permission to make a prayer.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བར་གྱུར་པ་དང་།
en: Then the Bhagavat remained silent.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱིན་གྱིས་བརླབས་ཀྱི་མཐུས་འཁོར་དེ་ཉིད་དུ་ལིཙྪ་བཱི་གཞོན་ནུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མཐོང་བར་དགའ་བ་ཞེས་བྱ་བ་ཞིག་འདུག་པར་གྱུར་པ་དེས་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་བྲམ་ཟེ་ཆེན་པོ་ཁྱོད་དེང་བཅོམ་ལྡན་འདས་ལས་སྨོན་ལམ་ཇི་ལྟ་བུ་ཞིག་ཡོངས་སུ་གཉེར་བར་འདོད་པ་བདག་གིས་ཁྱོད་ལ་སྦྱིན་པར་བྱའོ།
en: Through the power of the blessing of the Bhagavat, a Licchavī youth who was present there, by the name of Sarvasattvapriyadarśana, said to the Kauṇḍinya brahmin, “O great brahmin, what kind of prayer are you intent on receiving today from the Bhagavat? I will give it to you.” “

source: །བྲམ་ཟེས་སྨྲས་པ། ཀྱེ་གཞོན་ནུ་བདག་ནི་བླ་ན་མེད་པའི་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱེད་འདོད་པས། དེང་དེ་བཞིན་གཤེགས་པ་ལས་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་ཞིག་གསོལ་བ་འདེབས་པ་ཡིན་ནོ།
en: O young man,” replied the brahmin, “I wish to make offerings to the unsurpassable Bhagavat, and therefore today I am requesting from the Tathāgata a relic the size of a mustard seed.

source: བདག་གིས་སྔོན་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་སངས་རྒྱས་ཀྱི་རིང་བསྲེལ་དུ་ཡུངས་འབྲུ་ཙམ་ཞིག་ཐོབ་ནས་གུས་པས་རིམ་གྲོ་དང་མཆོད་པ་བྱས་ན་གང་ཟག་དེ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་ནང་དུ་སྐྱེས་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་བྱེད་པར་འགྱུར་རོ་ཞེས་ཐོས་པས་སོ།
en: I have heard that in the past, when a noble man or noble woman had obtained a relic the size of a mustard seed and with veneration honored it and made offerings to it, that individual was reborn in the Trāyastriṃśa paradise and became Śakra, the lord of the devas.”

source: །དེ་ནས་གཞོན་ནུ་དེས་བྲམ་ཟེ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གལ་ཏེ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷར་སྐྱེས་ནས་རྣམ་པར་སྨིན་པ་མཆོག་ལ་ལོངས་སྤྱོད་པར་འདོད་ན་སེམས་རྩེ་གཅིག་ཏུ་གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་མཉན་པར་བྱ་སྟེ།
en: The youth then said to the brahmin, “If you wish to be reborn in the Trāyastriṃśa paradise and enjoy the perfect ripening of karma, then you should listen, with single-pointed mind, to The Supremely Victorious King of Sūtras, the Sublime Golden Light.

source: མདོ་སྡེ་འདི་ནི་མདོ་སྡེ་ཐམས་ཅད་ཀྱི་ནང་ན་མཆོག་ཏུ་ཁྱད་པར་དུ་འཕགས་པ་ཡིན་པས་ཤེས་པར་དཀའ་ཞིང་འཇུག་པར་དཀའ་བས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱིས་ཀྱང་ཁོང་དུ་ཆུད་པར་མི་ནུས་སོ།
en: This sūtra is supreme among all sūtras, and therefore it is difficult to know and to penetrate. Therefore, the śrāvakas and pratyekabuddhas are unable to comprehend it.

source: །མདོ་སྡེ་འདི་ནི་བསོད་ནམས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཚད་མེད་པ་བསྐྱེད་པ་ནས་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་ཡང་མངོན་པར་འགྲུབ་པར་བྱེད་དེ།
en: This sūtra gives rise to the limitless ripening of the results of merit and accomplishes that until the attainment of the highest enlightenment.

source: དེང་བདག་གིས་ཁྱོད་ལ་དོན་གྱི་དངོས་པོ་མདོ་ཙམ་ཞིག་བསྟན་པ་ཡིན་ནོ།
en: Today I have taught you just a little portion of that subject.” “

source: །བྲམ་ཟེས་སྨྲས་པ། གཞོན་ནུ་ལེགས་སོ།
en: Well done, young man,” replied the brahmin. “

source: །གསེར་འོད་དམ་པ་མདོ་སྡེའི་རྒྱལ་པོ་འདི་ནི་ཤིན་ཏུ་ཟབ་ཅིང་མཆོག་ཏུ་གྱུར་པས་ཤེས་པར་ཡང་དཀའ་ལ་འཇུག་པར་ཡང་དཀའ་བས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱིས་ཀྱང་ཁོང་དུ་ཆུད་པར་མི་འགྱུར་ན་བདག་ཅག་མཐའ་འཁོབ་ཀྱི་མི་དམངས་རིགས་ཤེས་པ་ཤིན་ཏུ་ཕྲ་ཞིང་ཆུང་བས་རིག་པར་མི་འགྱུར་བ་ལྟ་ཅི་སྨོས་ཏེ།
en: This Supremely Victorious King of Sūtras, the Sublime Golden Light is very profound and supreme. It is difficult to know, difficult to penetrate, and therefore even the śrāvakas and pratyekabuddhas will not comprehend it. Therefore, it goes without saying that we, low-class people from the borderlands, with little, limited knowledge, will not understand it.

source: དེའི་ཕྱིར་དེང་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་ཡོངས་སུ་གཉེར་བ་ཡིན་ཏེ།
en: That is why today I seek a relic of the Tathāgata that is the size of a mustard seed.

source: རང་གི་གནས་སུ་ཁྱེར་ནས་རིན་པོ་ཆེའི་ཟ་མ་ཏོག་གི་ནང་དུ་བཅུག་སྟེ་གུས་པས་མཆོད་པ་དང་རིམ་གྲོ་བྱས་ན་ཚེ་འདས་པའི་འོག་ཏུ་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་བྱས་ནས་རྟག་པར་བདེ་བ་མྱོང་བར་འགྱུར་ན་ཁྱོད་ཀྱིས་དེང་ཅིའི་ཕྱིར་བདག་གི་ཆེད་དུ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་ལ་སྨོན་ལམ་འདི་ཅི་གསོལ་བ་འདེབས་པར་མི་བྱེད། དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: I will take it to my land, place it in a precious casket, and make offerings to it and honor it with veneration. Then, when I have passed away, I will be Śakra, the lord of the devas, and will continually experience happiness. For my sake, why don’t you make a prayer today to the one with wisdom and virtuous conduct?”

source: དེའི་ཚེ་གཞོན་ནུ་དེས་བྲམ་ཟེ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གང་གཱའི་འབའ་ཆུ་དྲག་པོ་ལས། །པདྨ་དཀར་པོ་སྐྱེ་འགྱུར་ཞིང་། །འཇོལ་མོ་དུང་ལྟར་གྱུར་པ་དང་། །བྱ་རོག་དམར་པོར་འགྱུར་བའམ། །གལ་ཏེ་འཛམ་བུའི་ལྗོན་ཤིང་ལས། །ཏ་ལའི་འབྲས་བུ་ཆགས་པ་དང་། །ཁརྫུ་ར་ཡི་ཡལ་ག་ལས། །ཨ་མྲའི་ལོ་མ་སྐྱེ་འགྱུར་བ། །ཡ་མཚན་དངོས་པོ་འདི་དག་ནི། །ཕན་ཚུན་རུང་པར་འགྱུར་སྲིད་ཀྱི།
en: Just then, the youth spoke these verses to the brahmin: “White lotuses growing from The fierce waves of the Ganges River, Nightingales becoming like conches, And crows becoming red; “Palm-tree fruit coming From rose-apple trees, And mango leaves growing On the branches of date trees— “It’s possible these marvelous things May happen alongside each other, But a relic of the Bhagavat Is something that will never be seen. “

source: །བཅོམ་ལྡན་འདས་ཀྱི་རིང་བསྲེལ་ནི། །མཐར་ནི་ནམས་ཀྱང་དམིགས་མི་འགྱུར། །གལ་ཏེ་རུ་སྦལ་སྤུ་ལས་ནི། །གོས་མཆོག་དམ་པ་རབ་བཏགས་ནས། །གྲང་ཚེ་བགོ་བར་རུང་འགྱུར་ན།
en: When sublime, excellent clothes That can be worn in the cold weather Are woven from the hair of turtles, Then seek for a relic of the Bhagavat. “

source: །བཅོམ་ལྡན་རིང་བསྲེལ་བཙལ་བར་བྱ། །གལ་ཏེ་སྦྲང་བུའི་རྐང་པ་ལས། །ཁང་པ་རྩེག་མ་བྱས་འགྱུར་ཏེ། །རབ་བརྟན་མི་གཡོ་གྱུར་པ་ན།
en: When the walls of a house Are built from the legs of flies And they are firm and solid, Then seek for a relic of the Bhagavat. “

source: །བཅོམ་ལྡན་རིང་བསྲེལ་བཙལ་བར་བྱ། །གལ་ཏེ་ཆུ་ཡི་ཛ་ལུ་ཀ། །ཁ་ནས་སོ་དཀར་སྐྱེས་གྱུར་ནས། །རིང་ཆེ་མཚོན་ལྟར་རྣོ་གྱུར་ན།
en: If there is a time when leeches Grow white teeth in their mouths That are long and sharp as weapons, Then seek for a relic of the Bhagavat. “

source: །བཅོམ་ལྡན་རིང་བསྲེལ་བཙལ་བར་བྱ། །གལ་ཏེ་རི་བོང་རྭ་ཐོགས་ནས། །ཐེམ་སྐས་རབ་གཙང་མངོན་བསྒྲུབས་ཏེ།
en: If there is a time when a hare’s horns Are taken and made into a pure ladder On which you can climb to the upper realms, Then seek for a relic of the Bhagavat. “

source: །མཐོ་རིས་གནས་སུ་འཛེག་རུང་ན། །བཅོམ་ལྡན་རིང་བསྲེལ་བཙལ་བར་བྱ། །བྱི་བས་ཐེམ་སྐས་དེ་འཛེགས་ཏེ། །ལྷ་མ་ཡིན་ལ་བསྡོ་བ་དང་། །ནམ་མཁའི་ཟླ་བ་སྒྲིབ་ནུས་ན།
en: When a mouse climbs that ladder And can attack the asuras And obscure the moon in the sky, Then seek for a relic of the Bhagavat. “

source: །བཅོམ་ལྡན་རིང་བསྲེལ་བཙལ་བར་བྱ། །གལ་ཏེ་སྦྲང་བུ་ར་རོ་ནས། །གྲོང་ཁྱེར་ཀུན་ཏུ་རབ་རྒྱུ་ཞིང་། །ཁང་ཁྱིམ་རྒྱ་ཆེར་བྱས་གྱུར་ན།
en: When a fly becomes drunk, Wanders through the towns, And builds a large house, Then seek for a relic of the Bhagavat. “

source: །བཅོམ་ལྡན་རིང་བསྲེལ་བཙལ་བར་བྱ། །གལ་ཏེ་བོང་བུའི་མཆུ་ཡི་མདོག །བིམ་པའི་འབྲས་ལྟར་དམར་འགྱུར་ཞིང་། །གླུ་གར་ལ་ནི་མཁས་གྱུར་ན།
en: When a donkey’s lips become As red as a bimba fruit, And it is skilled in song and dance, Then seek for a relic of the Bhagavat. “

source: །བཅོམ་ལྡན་རིང་བསྲེལ་བཙལ་བར་བྱ། །གལ་ཏེ་བྱ་རོག་འུག་པ་གཉིས། །གནས་གཅིག་ལྷན་ཅིག་རབ་བརྩེ་ཞིང་། །དེ་དག་ཕན་ཚུན་མཛའ་འགྱུར་ན།
en: When an owl and a crow Play together in one place And become great friends, Then seek for a relic of the Bhagavat. “

source: །བཅོམ་ལྡན་རིང་བསྲེལ་བཙལ་བར་བྱ། །གལ་ཏེ་པ་ལའི་འདབ་མ་ལས། །གདུགས་དང་བླ་རེ་མངོན་བསྒྲུབས་ཏེ། །ཆར་ཆེན་སྐྱབས་ནི་བྱས་གྱུར་ན།
en: When a parasol and a canopy are made From the leaves of the palash tree, And they give shelter from the falling rain, Then seek for a relic of the Bhagavat. “

source: །བཅོམ་ལྡན་རིང་བསྲེལ་བཙལ་བར་བྱ། །གལ་ཏེ་གྲུ་ཆེན་ཐམས་ཅད་ལས། །ནོར་དང་རིན་ཆེན་རབ་བཀང་སྟེ། །ཐང་བུ་སྐམ་ལ་འགྲོ་ནུས་ན། །བཅོམ་ལྡན་རིང་བསྲེལ་བཙལ་བར་བྱ།
en: When all the great ships, Filled with wealth and jewels, Are able to go on dry land, Then seek for a relic of the Bhagavat. “

source: །གལ་ཏེ་སྦྲང་བུ་ལྕགས་ཕྱེ་མཆུས། །སྤོས་ཀྱི་རི་བོ་ཁྱེར་ནས་ནི། །དགའ་མགུར་འཕུར་ཞིང་འགྲོ་གྱུར་ན། །བཅོམ་ལྡན་རིང་བསྲེལ་བཙལ་བར་བྱ།
en: When a fly picks up Gandhamādana Mountain In its beak of iron powder And happily flies away with it, Then seek for a relic of the Bhagavat.”

source: །དེ་ནས་དེའི་ཚེ་བྲམ་ཟེ་ཆོས་ཀྱི་སློབ་དཔོན་གྱིས་ལུང་བསྟན་པས་ཚིགས་སུ་བཅད་པ་འདི་དག་ཐོས་ནས་གཞོན་ནུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མཐོང་བར་དགའ་བ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། ལེགས་སོ་གཞོན་ནུ་ཆེན་པོ་ཁྱོད།
en: Having heard those verses, the brahmin Dharma master Vyākaraṇa then replied in verse to Sarvasattvapriyadarśana, the Licchavī youth: “Well done, you great young man!

source: །འཁོར་འདི་ཀུན་གྱི་བཀྲ་ཤིས་ཡིན།
en: You are the good fortune of this assembly.

source: །ཐབས་ལ་མཁས་པའི་སེམས་ཀྱིས་ནི། །བླ་མེད་སངས་རྒྱས་ལུང་བསྟན་ཐོབ།
en: Son of the jinas, with great words And a mind that is skilled in methods, Your unsurpassable buddhahood has been prophesied. “

source: །དེ་བཞིན་གཤེགས་པ་གཟིགས་ཆེན་གྱིས། །འཇིག་རྟེན་དག་ནི་སྐྱོབ་མཛད་པས།
en: The Tathāgata, with great vision, Is a protector of the world.

source: །ཁྱོད་ཀྱིས་རྩེ་གཅིག་ཉོན་ཅིག་དང་། །དེང་བདག་རིམ་བཞིན་བཤད་པར་བྱ།
en: Therefore, you should listen one-pointedly, As today I will teach this in stages. “

source: །སངས་རྒྱས་སྤྱོད་ཡུལ་བསམ་དཀའ་བས། །འཇིག་རྟེན་དག་ན་མཚུངས་པ་མེད།
en: The range of the buddhas is inconceivable; They have no equal in these worlds.

source: །ཆོས་སྐུ་ངོ་བོ་རྟག་བཞུགས་པས། །རྣལ་འབྱོར་སྒོམ་ལ་ཁྱད་པར་མེད།
en: They constantly remain in the Dharma body’s nature, So there is no difference in their meditation practice. “

source: །སངས་རྒྱས་སྐུ་ཀུན་མཚུངས་པས་ན། །ཆོས་གསུངས་པ་ཡང་དེ་བཞིན་ཏེ།
en: All the bodies of the buddhas are the same, And so is their teaching of the Dharma.

source: །སངས་རྒྱས་རྣམས་ལ་མཛད་མི་མངའ།
en: The buddhas do not have any deeds.

source: །གཟོད་མ་ཉིད་ནས་སྐྱེ་བ་མེད།
en: They are primordially without birth. “

source: །བཅོམ་ལྡན་རྡོ་རྗེའི་སྐུ་ཡིན་ཡང་། །ཐབས་ཀྱིས་སྤྲུལ་པའི་སྐུ་སྟོན་པས།
en: The Bhagavat has a vajra body; Through method he manifests a emanation body.

source: །དེ་ཕྱིར་བཅོམ་ལྡན་རིང་བསྲེལ་ནི། །ཡུངས་འབྲུ་ཙམ་ཡང་ཡོད་པ་མིན།
en: Therefore, the Bhagavat does not produce A relic even the size of a mustard seed. “

source: །བཅོམ་ལྡན་ཤ་ཁྲག་སྐུ་མིན་ན། །ཇི་ལྟར་རིང་བསྲེལ་ཡོད་པར་འགྱུར།
en: The Bhagavat does not have a flesh-and-blood body, So how could there be relics from it?

source: །སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་ཕྱིར། །ཐབས་ཀྱིས་སྐུ་གདུང་གཞག་པ་ཡིན།
en: But in order to bring benefit to beings, Through method he leaves a body. “

source: །ཆོས་སྐུ་ཡང་དག་སངས་རྒྱས་པས།
en: The Dharma body is the true buddha.

source: །ཆོས་དབྱིངས་དེ་བཞིན་གཤེགས་པ་ཡིན།
en: The Dharma realm is the Tathāgata.

source: །ཡང་དག་སྐུ་ནི་འདི་ཡིན་པས། །དེ་འདྲའི་ཆོས་ནི་གསུངས་པར་མཛད།
en: This is what the true body is, and so That is the kind of Dharma that is taught.”

source: །དེ་ནས་འཁོར་འདུས་པ་དེ་ཉིད་དུ་ལྷའི་བུ་སུམ་ཁྲི་ཉིས་སྟོང་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་ཤིན་ཏུ་རིང་བར་བསྟན་པ་ཐོས་ནས་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་དགའ་བ་དང་། མགུ་བ་དང་།
en: Then thirty-two thousand devas within that assembly, having heard that teaching on the length of the extremely long lifespan of the Tathāgata, developed the aspiration for the highest, most complete enlightenment.

source: རངས་པ་ཐོབ་པས་ཐམས་ཅད་མགྲིན་གཅིག་ཏུ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། སངས་རྒྱས་མྱ་ངན་མི་འདའ་སྟེ། །ཡང་དག་ཆོས་ཀྱང་ནུབ་མི་འགྱུར།
en: They had attained marvelous, wonderful happiness, delight, and joy, and they all spoke these verses in one voice: “The Buddha does not pass into nirvāṇa; The true Dharma never disappears.

source: །སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་ཕྱིར། །མྱ་ངན་འདའ་བར་བསྟན་པ་ཡིན།
en: But in order to bring benefit to beings, He manifests passing into nirvāṇa. “

source: །བཅོམ་ལྡན་བསམ་གྱིས་མི་ཁྱབ་ཅིང་། །སྐུ་མཆོག་ཐ་དད་མཚན་མེད་ཀྱང་།
en: The Bhagavat is inconceivable; His supreme body does not have separate features.

source: །སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་ཕྱིར། །བཀོད་པ་སྣ་ཚོགས་སྟོན་པར་མཛད། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་དེ་བཞིན་གཤེགས་པ་བཞི་དང་། སྐྱེས་བུ་ཆེན་པོ་དེ་གཉིས་དང་། ལྷའི་བུ་རྣམས་ལས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད་བསྟན་པ་མངོན་སུམ་དུ་ཐོས་པས་ཡང་འདུག་པའི་སྟན་ལས་ལངས་ཏེ་ཐལ་མོ་སྦྱར་ནས་གུས་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: But in order to bring benefit to beings, He demonstrates a variety of displays.”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཡང་དག་པར་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་ཞིང་རིང་བསྲེལ་ཡང་མི་མངའ་བ་ཞིག་ལགས་ན་ཅིའི་སླད་དུ་མདོ་སྡེ་ལས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་། སངས་རྒྱས་ལ་རིང་བསྲེལ་མངའ་བར་གསུངས་ཤིང་། ལྷ་དང་མི་རྣམས་ཀྱིས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། མཆོད་པ་བགྱིད་པར་འགྱུར་བའི་ཆེད་དུ་འདས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་སྐུ་གདུང་མངའ་བར་བསྟན་ཅིང་འཇིག་རྟེན་ན་བཞུགས་པས་ལྷ་དང་མི་རྣམས་ཀྱིས་མཆོད་ཅིང་རིམ་གྲོ་བགྱིས་ན་བསོད་ནམས་དཔག་ཏུ་མ་མཆིས་པ་ཐོབ་པར་འགྱུར་རོ།
en: After the bodhisattva Ruciraketu heard in the presence of the Bhagavat the teaching on the Tathāgata Śākyamuni’s lifespan directly from the four tathāgatas, those two great beings, and the devas, he rose from his seat, placed his palms together, and reverently said, “Bhagavat, if truly in this way the tathāgatas do not pass into nirvāṇa and do not leave relics, why is it taught in the sūtras that the Buddha passes into nirvāṇa and leaves relics, and that past buddhas also have manifested a deceased body and left it in the world so that devas and humans can show veneration and respect and make offerings, so that devas and humans, through making offerings and showing veneration, will attain immeasurable merit?

source: །ཞེས་གསུངས་ལ། དེང་ནི་མ་མཆིས་སོ་ཞེས་གསུངས་པས་ཐེ་ཙོམ་དང་སོམ་ཉི་འཚལ་བར་གྱུར་ན།
en: Today it has been said that there are none, and so I have doubt and uncertainty.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ལ་ཐུགས་བརྩེ་བར་དགོངས་ཏེ་རྒྱ་ཆེར་རྣམ་པར་དབྱེ་བར་གསོལ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་དང་། འཁོར་མང་པོ་རྣམས་ལ་བཀའ་སྩལ་པ། ཁྱོད་ཀྱིས་འདི་ལྟར་ཤེས་པར་བྱ་སྟེ།
en: Bhagavat, I pray that you regard us with compassion and elucidate this in detail.”

source: ཡོངས་སུ་མྱ་ངན་ལས་འདའ་ཞིང་རིང་བསྲེལ་ཡོད་དོ།
en: The Bhagavat then said to the bodhisattva mahāsattva Ruciraketu and the great assembly, “This is what you should know: the teaching that there is a passing into nirvāṇa and that there are relics is taught with an implied meaning.

source: །ཞེས་གསུངས་པ་ནི་དགོངས་པའི་དབང་གིས་གསུངས་པ་ཡིན་པས་འདི་ལྟར་དེའི་དོན་གང་ཡིན་པ་སེམས་རྩེ་གཅིག་ཏུ་ཉོན་ཅིག །
en: Therefore, listen one-pointedly to what that meaning is. “

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་འདི་ལྟར་ཆོས་རྣམ་པ་བཅུས་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི། དེ་ཁོ་ན་ཉིད་ཀྱི་དོན་གྱི་ཚུལ་གྱིས་མཐར་ཕྱིན་པའི་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཡོད་པར་གསུངས་པ་གང་ཡིན་པ་ཤེས་པར་འགྱུར་བར་རིག་པར་བྱའོ།
en: Noble one, the bodhisattvas mahāsattvas know to understand in this way, through these ten qualities, that the Tathāgata, the complete Buddha, teaches the ultimate great passing into nirvāṇa according to the meaning of its true nature. “

source: །བཅུ་གང་ཞེ་ན།
en: What are these ten? “

source: དང་པོ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་ཤེས་བྱའི་སྒྲིབ་པ་མ་ལུས་པར་སྤངས་ཤིང་ཟད་པར་གྱུར་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: First, nirvāṇa means that the tathāgatas have completely eliminated every obscuration by the kleśas and every obscuration of knowledge; they have all ceased. “

source: །གཉིས་པ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་སེམས་ཅན་ངོ་བོ་ཉིད་མེད་པ་དང་ཆོས་ངོ་བོ་ཉིད་མེད་པར་ལེགས་པར་ཐུགས་སུ་ཆུད་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Second, nirvāṇa means that the tathāgatas have perfectly realized that beings have no essence and phenomena have no essence. “

source: །གསུམ་པ་ནི་ལུས་ཀྱི་གནས་དང་ཆོས་ཀྱི་གནས་ཡོངས་སུ་གྱུར་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Third, nirvāṇa means that there is a transformation of the state of the body and the state of qualities. “

source: །བཞི་པ་ནི་སེམས་ཅན་རྣམས་ལ་དོན་མཛད་པའི་རྒྱུ་དང་རྐྱེན་རང་གི་ངང་གིས་ཉེ་བར་ཞི་བར་གྱུར་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Fourth, nirvāṇa means that the causes and conditions for benefiting beings have naturally ceased. “

source: །ལྔ་པ་ནི་དེ་ཁོ་ན་ཉིད་ཀྱི་མཚན་ཉིད་ཐ་དད་པ་མེད་པ་མཉམ་པ་ཉིད་ཀྱིས་ཆོས་ཀྱི་སྐུ་མངོན་སུམ་དུ་བརྙེས་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Fifth, nirvāṇa means that there is the direct attainment of Dharma body because of the sameness and absence of differentiation in the characteristics of the true nature. “

source: །དྲུག་པ་ནི་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ལ་ངོ་བོ་ཉིད་གཉིས་སུ་མེད་པར་ཐུགས་སུ་ཆུད་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Sixth, nirvāṇa means that there is the realization that there is no duality in the nature of saṃsāra and nirvāṇa. “

source: །བདུན་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྩ་བ་ཐུགས་སུ་ཆུད་ནས། རྣམ་པར་དག་པ་མངོན་སུམ་དུ་གྱུར་པའི་ཕྱིར། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Seventh, nirvāṇa means that purity is manifested through the realization of the root of phenomena. “

source: །བརྒྱད་པ་ནི་ཆོས་ཐམས་ཅད་ལ་སྐྱེ་བ་མེད་ཅིང་འགག་པ་མེད་པར་རྣལ་འབྱོར་ལེགས་པར་བསྒོམས་པའི་ཕྱིར། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Eighth, nirvāṇa means that there has been perfect practice of meditation on all phenomena being devoid of birth and devoid of cessation. “

source: །དགུ་པ་ནི་དེ་བཞིན་ཉིད་དང་ཆོས་ཀྱི་དབྱིངས་དང་། ཡང་དག་པའི་མཐའ་མཉམ་པ་ཉིད་ཀྱིས་ཡང་དག་པའི་ཡེ་ཤེས་བརྙེས་པའི་ཕྱིར། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Ninth, nirvāṇa means that there has been the attainment of wisdom through the sameness of the true nature, the realm of phenomena, and the ultimate conclusion. “

source: །བཅུ་པ་ནི་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་དང་མྱ་ངན་ལས་འདས་པའི་ངོ་བོ་ཉིད་ལ་བྱེ་བྲག་མེད་པ་བརྙེས་པའི་ཕྱིར། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་སྟེ།
en: Tenth, nirvāṇa means that there is the attainment of there being no difference between the nature of all phenomena and the nature of nirvāṇa. “

source: རིགས་ཀྱི་བུ་འདི་དག་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཡོད་པར་བསྟན་པའི་ཆོས་རྣམ་པ་བཅུ་ཞེས་བྱའོ།
en: Noble one, those are the ten qualities of the teaching that there is a passing into nirvāṇa. “

source: །གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་འདི་ལྟར་ཆོས་རྣམ་པ་བཅུས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་དེ་ཁོ་ན་ཉིད་ཀྱི་དོན་གྱི་ཚུལ་གྱིས་མཐར་ཕྱིན་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཡོད་པར་གསུངས་པ་གང་ཡིན་པ་ཤེས་པར་འགྱུར་བར་རིག་པར་བྱའོ།
en: Also, noble one, the bodhisattvas mahāsattvas know and understand in this way, through these ten qualities, that the Tathāgata Arhat Samyaksaṃbuddha teaches the ultimate, great passing into nirvāṇa according to the meaning of its true nature. “

source: དང་པོ་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་ནི་འདོད་པས་གཞི་བྱས་པ་ཡིན་པས་འདོད་པ་ལས་སྐྱེས་པ་ཡིན་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་འདོད་པ་ཡོངས་སུ་བཅད་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: First, desire is the basis of the kleśas, so they arise from desire, and the buddha bhagavats completely eliminate desire, and this is called nirvāṇa. “

source: །གཉིས་པ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཉོན་མོངས་པའི་འདོད་པ་རྣམས་ཡོངས་སུ་བཅད་པས་ཆོས་འགའ་ཡང་ལེན་པར་མི་མཛད་ལ། ལེན་པར་མི་མཛད་པའི་ཕྱིར་གཤེགས་པ་ཡང་མི་མངའ་བྱོན་པ་ཡང་མི་མངའ་ཞིང་ལེན་པ་མི་མངའ་བའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Second, the tathāgatas have completely eliminated the kleśa of desire, and therefore they do not gain acquisition of any phenomenon, and because they do not gain such acquisition, they have no going, no coming, and no acquisition, and therefore this is called nirvāṇa. “
